In [ ]:
# For titanic datset : 
1 . Find out how many male and female passenger was onboarded .
2. how many survived we have .
3. how many casuality we have 
4 . what is name of a person who is the eldest one . 
5 . how many passenger do we have in first , second and third class 
6. how many person we have whose name starts with "s"
7. try to create a new column which is a summation  of "SibSp" and "parch"
8 . how many person do we have below age of 25 .
9 . how many person died whose age was less then 40 
10 . from a  cabin column seperate text and numeric value .

In [4]:
import pandas as pd
df=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 1 . Find out how many male and female passenger was onboarded .

In [7]:
len(df[df['Sex']=='male'])

577

In [8]:
len(df[df['Sex']=='female'])

314

In [44]:
df.groupby(df['Sex']).size()

Sex
female    314
male      577
dtype: int64

### 2. how many survived we have .

In [9]:
len(df[df['Survived']==1])

342

### 3. how many casuality we have

In [30]:
len(df[df['Embarked']=='C'])

168

### 4 . what is name of a person who is the eldest one .

In [11]:
df[df['Age']==max(df['Age'])]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

### 5 . how many passenger do we have in first , second and third class

In [12]:
len(df[df['Pclass']==1])

216

In [13]:
len(df[df['Pclass']==2])

184

In [14]:
len(df[df['Pclass']==3])

491

In [39]:
df.groupby(df['Pclass']).size()

Pclass
1    216
2    184
3    491
dtype: int64

### 6. how many person we have whose name starts with "s"

In [15]:
len(df[df['Name'].str.startswith('B')==True])

72

### 7. try to create a new column which is a summation  of "SibSp" and "parch"

In [16]:
df['sum_sibsp_parch']=df['SibSp']+df['Parch']

In [18]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sum_sibsp_parch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

### 8 . how many person do we have below age of 25 .

In [19]:
len(df[df['Age'] <25])

278

### 9 . how many person died whose age was less then 40

In [20]:
len(df[(df['Age']<40) & (df['Survived']==0)])

322

### 10 . from a  cabin column seperate text and numeric value .

In [29]:
cabin=df[df['Cabin'].isnull()==False]['Cabin']
cabin
cabin_sep=cabin.str.extract('([A-Z]+)+([\d\.]+)')
cabin_sep

     0    1
1    C   85
3    C  123
6    E   46
10   G    6
11   C  103
..  ..  ...
871  D   35
872  B   51
879  C   50
887  B   42
889  C  148

[204 rows x 2 columns]